---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.NetworkCommunicationException
source: html/ed1d7d44-4568-ef31-b748-0873512f1193.htm
---
# NetworkCommunicationException Members

Retrieves data needed to serialize the target object.